[
  {
    "title": "Talentboozt Job Portal",
    "slug": "talentboozt",
    "description": "A SaaS-based job portal designed to simplify the recruitment process. It offers a comprehensive platform for employers and job seekers, similar to LinkedIn but without a social feed.",
    "tech": {
      "languages": ["TypeScript", "Java", "HTML", "SCSS", "noSQL"],
      "frameworks": ["Angular", "Spring Boot", "Bootstrap", "Materials"],
      "tools": ["MongoDB", "JWT", "Firebase", "AWS", "Netlify"]
    },
    "image": "/projects/background.svg",
    "link": "https://talentboozt.com/",
    "details": {
      "overview": "Talentboozt is a job portal that streamlines recruitment for both job seekers and employers. It provides a structured, user-friendly experience for job applications, profile management, and career growth.",
      "problem": "Existing job portals often clutter the user experience with social feeds and irrelevant content. Job seekers struggle with disorganized application tracking, while employers lack an efficient way to manage hiring. A dedicated, streamlined hiring platform is needed.",
      "task": "Develop a modern, SaaS-based recruitment platform with essential features for job seekers and employers, focusing on application management, profile creation, and career preparation.",
      "solutions": [
        "User Profiles: Employers, employees, and companies can maintain structured profiles.",
        "Following System: Users can follow companies and professionals for updates.",
        "Job Management: Users can track job applications under different statuses.",
        "Interview Preparation: Provides access to professional Q&As for interview readiness.",
        "Login Streaks: A calendar logs user login dates, encouraging daily visits.",
        "Seamless Experience: A social-feed-free environment for focused job searching."
      ],
      "features": [
        "Free job application process",
        "Saved, applied, in-progress, and rejected job tracking",
        "Company pages for employer branding",
        "Professional interview preparation Q&As",
        "Daily login streak tracker for engagement"
      ],
      "projectType": "Web Application (SaaS)",
      "duration": "July 2024 - Present",
      "note": "🚨 Due to privacy and security considerations, the source code for this project is not publicly available. However, you can explore the live demo!",
      "github": "",
      "live_demo": "https://talentboozt.com/"
    }
  },
  {
    "title": "Talentboozt Job Recruiter",
    "slug": "talentboozt-recruiter",
    "description": "An enterprise SaaS platform designed to simplify the hiring process for companies. Offers job posting, applicant tracking, analytics, and branding features under multiple subscription plans.",
    "tech": {
      "languages": ["TypeScript", "Java", "HTML", "SCSS", "noSQL"],
      "frameworks": ["Angular", "Spring Boot", "Bootstrap", "Materials"],
      "tools": ["MongoDB", "Stripe", "Firebase", "AWS", "Netlify"]
    },
    "image": "/projects/background.svg",
    "link": "https://talentboozt.com/recruiter",
    "details": {
      "overview": "Talentboozt Job Recruiter is a hiring platform that enables companies to streamline recruitment with job postings, applicant tracking, and data analytics. Businesses can choose from different plans that cater to their hiring needs.",
      "problem": "Recruiters often face challenges in managing job postings, tracking applicants efficiently, and gaining insights into hiring performance. Many existing solutions lack flexibility or are overly expensive. Talentboozt provides a structured, scalable, and cost-effective recruitment solution.",
      "task": "Develop a SaaS hiring platform that allows companies to post and manage job listings, track applicants, analyze recruitment data, and customize hiring strategies.",
      "solutions": [
        "Job Posting & Management: Enables companies to create, edit, and manage job listings effortlessly.",
        "Recruitment Analytics: Provides dashboards for tracking job performance and applicant engagement.",
        "Company Branding: Allows employers to customize job ads and company profiles to attract the right candidates.",
        "Applicant Tracking: Helps recruiters monitor applicants, assess profile match scores, and shortlist candidates.",
        "Verified Employer Badge: Boosts credibility and visibility in job listings.",
        "Custom Job Ad Expiration: Allows businesses to set expiration dates for job postings based on their hiring needs."
      ],
      "features": [
        "Post and manage job listings",
        "Recruitment analytics dashboard",
        "Company profile customization",
        "Verified employer badge (for pro users)",
        "Applicant tracking and profile scoring",
        "Custom branding for job advertisements"
      ],
      "projectType": "Web Application (SaaS)",
      "duration": "July 2024 - Present",
      "note": "🚨 Due to privacy and security considerations, the source code for this project is not publicly available. However, you can explore the live demo!",
      "github": "",
      "live_demo": "https://talentboozt.com"
    }
  },
  {
    "title": "Ethical AI driven Geographic Analytics Platform",
    "slug": "urbanair",
    "description": "An AI-powered air quality monitoring and prediction system with learning and ethical considerations.",
    "tech": {
      "languages": ["Typescript", "Java", "Python", "HTML", "SCSS", "noSQL"],
      "frameworks": ["Angular", "Express", "Springboot", "Bootstrap", "Materials"],
      "tools": ["MongoDB", "JWT", "MailSender", "Py4j", "Docker", "Render", "Netlify"]
    },
    "image": "/projects/background.svg",
    "link": "https://urban-air-quality-monitor.netlify.app/",
    "details": {
      "overview": "This project aims to develop a Geographic Analytics Platform driven by Ethical AI to meet the growing demand for environmentally focused data analysis. With increasing concerns about the environment and the merging of data analytics, there is a need for a platform that combines these elements to facilitate well-informed decision-making. This platform will enable users to analyze geographic data while adhering to ethical standards.",
      "problem": "Current environmental data analysis often lacks ethical considerations and a centralized platform, leading to fragmented and unreliable data. This makes it challenging to make informed decisions regarding air quality, land use, and meteorological conditions. The absence of a unified, ethical solution hinders the ability to address environmental issues effectively.",
      "task": "The primary task is to design and develop a modern, user-friendly Geographic Analytics Platform that integrates AI and data analytics to provide insights into air quality, land use, and meteorological conditions. The platform must incorporate ethical standards throughout the data processing lifecycle and support real-time data integration, predictive modeling, and cross-domain collaboration.",
      "solutions": [
        "Ethical Framework: Develop and implement a framework to integrate ethical considerations into all stages of data processing.",
        "Predictive Modeling: Utilize effective predictive modeling techniques to ensure accurate and reliable projections.",
        "User-Friendly Design: Create intuitive and accessible interfaces for users with varying levels of expertise.",
        "Centralized Data Processing: Establish robust strategies for consistent and reliable data processing.",
        "Real-Time Data Integration: Integrate real-time data sources to enhance responsiveness to environmental changes.",
        "Cross-Domain Collaboration: Facilitate collaboration across different domains to support holistic decision-making.",
        "Data Privacy and Security: Implement stringent measures to protect sensitive information and comply with data protection regulations."
      ],
      "features": [
        "Real-time air quality monitoring",
        "AI-driven prediction models",
        "Historical data analysis",
        "Interactive dashboards"
      ],
      "projectType": "Web Application",
      "duration": "Dec 2023 - April 2024",
      "github": "https://github.com/kavicastelo/Ethical-AI-driven-Geographic-Analytics-Platform.git",
      "live_demo": "https://urban-air-quality-monitor.netlify.app/"
    }
  },
  {
    "title": "Talentboozt Resume Builder",
    "slug": "talentboozt-resume-builder",
    "description": "A fully ATS-supported resume builder offering multiple CV templates and seamless integration with the Talentboozt Job Portal. Users can create a resume for free or opt for professional resume-building services.",
    "tech": {
      "languages": ["TypeScript", "Java", "HTML", "SCSS"],
      "frameworks": ["Angular", "Spring Boot", "Bootstrap"],
      "tools": ["MongoDB", "JWT", "localStorage", "AWS", "Netlify"]
    },
    "image": "/projects/background.svg",
    "link": "https://cv.talentboozt.com",
    "details": {
      "overview": "Talentboozt Resume Builder provides a user-friendly solution for creating ATS-compatible resumes. It offers multiple CV templates, direct integration with the Talentboozt Job Portal, and shared authentication across all Talentboozt services.",
      "problem": "Many job seekers struggle with creating ATS-friendly resumes that pass screening systems. Additionally, platforms often require users to re-enter the same details across different job-related services.",
      "task": "Develop a resume builder that enables users to create professional resumes quickly, offers ATS-compliant templates, and seamlessly integrates with the Talentboozt Job Portal for effortless job applications.",
      "solutions": [
        "ATS-Compatible Templates: Provides pre-designed templates optimized for applicant tracking systems.",
        "Seamless Job Portal Integration: Resumes created here can be used directly on the Talentboozt Job Portal.",
        "Single Authentication: Users can log in once and access all Talentboozt services without re-registering.",
        "Resume Autofill: Users with a Talentboozt Job Portal account can auto-import their details into this platform.",
        "Paid Resume Services: For $5, users can get professional resume-building assistance (optional)."
      ],
      "features": [
        "Multiple ATS-friendly resume templates",
        "Free resume creation and download",
        "Direct integration with the Talentboozt Job Portal",
        "Shared authentication across all Talentboozt platforms",
        "Optional professional resume-building service ($5)",
        "No cloud data storage for privacy-focused users"
      ],
      "projectType": "Web Application (SaaS)",
      "duration": "Ongoing",
      "note": "🚨 Due to privacy and security considerations, the source code for this project is not publicly available. However, you can explore the live demo!",
      "github": "",
      "live_demo": "https://cv.talentboozt.com"
    }
  },
  {
    "title": "Talentboozt Trainee Platform",
    "slug": "talentboozt-trainee",
    "description": "An interactive learning platform where job seekers can find, sort, and participate in various courses, including both free and paid live sessions.",
    "tech": {
      "languages": ["TypeScript", "Java", "HTML", "SCSS"],
      "frameworks": ["Angular", "Spring Boot", "Bootstrap"],
      "tools": ["MongoDB", "JWT", "Stripe", "AWS", "Firebase", "Netlify"]
    },
    "image": "/projects/background.svg",
    "link": "https://courses.talentboozt.com",
    "details": {
      "overview": "The Talentboozt Trainee Platform helps job seekers enhance their skills through a structured learning environment with various free and paid courses. Integrated with the Talentboozt Job Portal, this platform enables users to showcase their participated courses on their profiles.",
      "problem": "Many job seekers struggle to find high-quality courses that align with their career goals. Additionally, course participation is often disconnected from job application platforms, making it hard to showcase learning progress.",
      "task": "Develop an easy-to-use course platform where job seekers can discover, participate in, and showcase their learning experiences while ensuring secure payments and seamless integration with other Talentboozt services.",
      "solutions": [
        "Advanced Search & Sorting: Helps users find suitable courses efficiently.",
        "Live & Pre-recorded Courses: Supports different learning formats.",
        "Secure Payments: Uses Stripe for secure transactions.",
        "Live Course Notifications: Alerts users about upcoming live sessions.",
        "Integration with Talentboozt Job Portal: Allows users to showcase completed courses on their profiles."
      ],
      "features": [
        "Search and sort courses by category, difficulty, and price",
        "Participate in live and recorded courses",
        "Secure Stripe-based payments",
        "Automatic notifications for live course start times",
        "Showcase completed courses on Talentboozt profiles",
        "Access to all Talentboozt platforms with a single registration"
      ],
      "projectType": "Web Application (SaaS)",
      "duration": "March 2025 - Present",
      "note": "🚨 Due to privacy and security considerations, the source code for this project is not publicly available. However, you can explore the live demo!",
      "github": "",
      "live_demo": "https://courses.talentboozt.com"
    }
  },
  {
    "title": "Talentboozt Trainer Platform",
    "slug": "talentboozt-trainer",
    "description": "A course management platform for trainers to post, manage, and monetize their courses while handling enrollments and payments efficiently.",
    "tech": {
      "languages": ["TypeScript", "Java", "HTML", "SCSS"],
      "frameworks": ["Angular", "Spring Boot", "Bootstrap"],
      "tools": ["MongoDB", "JWT", "Stripe", "AWS", "Firebase", "Netlify"]
    },
    "image": "/projects/background.svg",
    "link": "https://trainer.talentboozt.com",
    "details": {
      "overview": "The Talentboozt Trainer Platform empowers course creators by providing a streamlined platform to publish, manage, and monetize courses. Trainers can track user enrollments, handle payments securely via Stripe, and ensure a seamless learning experience.",
      "problem": "Trainers often struggle with complex course management tools, inefficient payment processing, and a lack of integration with professional networks for better reach.",
      "task": "Build a comprehensive trainer platform where educators can easily create and manage courses, accept payments, track enrollments, and optimize learning experiences.",
      "solutions": [
        "Course Management System: Allows trainers to create and modify courses.",
        "User Enrollment Management: Tracks enrolled participants and manages course access.",
        "Secure Payment Handling: Uses Stripe for processing transactions.",
        "Live Course Scheduling: Provides options to manage live session timings.",
        "Future Analytics Integration: The first release excludes analytics but will be included in upcoming updates."
      ],
      "features": [
        "Create and manage courses",
        "Track enrolled users and manage course participation",
        "Secure Stripe-powered payment processing",
        "Manage live course schedules",
        "Integration with Talentboozt ecosystem",
        "Analytics to be added in future releases"
      ],
      "projectType": "Web Application (SaaS)",
      "duration": "March 2025 - Present",
      "note": "🚨 Due to privacy and security considerations, the source code for this project is not publicly available. However, you can explore the live demo!",
      "github": "",
      "live_demo": "https://trainer.talentboozt.com"
    }
  }
]
